/**
 *
 */
package rgsJava2.p13.pp02.list13_01;

/**
 * マタンゴ
 * @author RedHands
 *
 */
public class Matango {
	//=======================================================================
	// variable
	//=======================================================================
	/**
	 * Hit Point
	 */
	private int hp;
	/**
	 * モンスターレベル
	 */
	final int LEVEL = 10;
	/**
	 * モンスター個別認識
	 */
	private char suffix;
	//=======================================================================
	// getter/setter
	//=======================================================================
	/**
	 * @return hp
	 */
	public int getHp() {
		return hp;
	}
	/**
	 * @param hp セットする hp
	 */
	public void setHp(int hp) {
		this.hp = hp;
	}
	//=======================================================================
	// Method
	//=======================================================================
	/**
	 * 実行
	 */
	void run() {
		System.out.println("お化けキノコ" + this.suffix + "は逃げ出した！");
	}

}
