//  
//  他のプログラムの実行など


/****************************************************************************
 * グローバルオブジェクト取得
 ***************************************************************************/
var wsh = new ActiveXObject("WScript.Shell");

/****************************************************************************
 * 起動
 ***************************************************************************/
function withExecCommand(cmd, func) {
	var exec = wsh.exec(cmd);
	while (!exec.StdOut.AtEndOfStream) {
		func(exec.StdOut.ReadLine());
	}
	return exec.ExitCode;
}
function execCommand(cmd) {
	return withExecCommand(cmd, function (line) { WScript.Echo(line);});
}
/****************************************************************************
 * @ 実行
 ***************************************************************************/
// コマンド起動
execCommand("cmd /C dir");



