/**
 *
 */
package rgsJava2.p13.list13_01.monster;

/**
 * 地獄コウモリ
 * @author h-dodo
 * @see rgsJava2.p13.list13_01.monster.Monster
 */
public class DeathBat extends Monster {
	//=======================================================================
	// variable
	//=======================================================================
	/**
	 * モンスターレベル
	 */
	final int LEVEL = 10;
	//=======================================================================
	// Method
	//=======================================================================
	/**
	 * 逃亡
	 */
	public void run() {
		System.out.println("地獄コウモリ" + this.getSuffix() + "は逃げ出した！");
	}
}
