/**
 *
 */
package rgsJava2.p13.list13_01.monster;

/**
 * お化けキノコ
 * @author RedHands
 * @see rgsJava2.p13.list13_01.monster.Monster
 */
public class Matango extends Monster  {
	//=======================================================================
	// variable
	//=======================================================================
	/**
	 * モンスターレベル
	 */
	final int LEVEL = 10;
	//=======================================================================
	// Method
	//=======================================================================
	/**
	 * 逃亡
	 */
	public void run() {
		System.out.println("お化けキノコ" + this.getSuffix() + "は逃げ出した！");
	}

}
